In [25]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
df = pd.read_csv("heights.csv")
df.head()

    name  height
0  mohan     1.2
1  maria     4.6
2  sakib     4.9
3    tao     5.1
4  virat     5.2

## Remove Outlier using IQR

In [26]:
Q1,Q3=df.height.quantile([0.25,0.75])
Q1,Q3

(5.3500000000000005, 6.275)

In [27]:
IQR=Q3-Q1
IQR

0.9249999999999998

In [28]:
lower_limit=Q1-1.5*IQR
upper_limit=Q3+1.5*IQR
lower_limit,upper_limit

(3.962500000000001, 7.6625)

In [29]:
# No Outlier is the lower_limit < x < Higher_limit
# the value which is less than the lower limit and greater than the higher limit this is Outlier
df[df.height<lower_limit]             ## lower limit outlier

    name  height
0  mohan     1.2

In [30]:
df[df.height>higher_limit]               ## higher limit outlier

   name  height
19  Liu    40.2

In [31]:
## Check Outlier
df[(df.height<lower_limit) | (df.height>higher_limit)]

     name  height
0   mohan     1.2
19    Liu    40.2

In [32]:
## Remove Outlier
no_outlier_df=df[(df.height>lower_limit) & (df.height<higher_limit)]
no_outlier_df

       name  height
1     maria     4.6
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     6.6
17    aamir     7.1
18      ken     7.1

## Remove Outlier Using Box Plot

In [33]:
df=pd.read_excel("region_wise_sales.xlsx")
df.head()

      Month  Year Region  Sales
0   January  2022   APAC  36750
1  February  2022   APAC  36995
2     March  2022   APAC  18579
3     April  2022   APAC  37768
4       May  2022   APAC  23956

In [34]:
df.Region.unique()

array(['APAC', 'Europe', 'Americas'], dtype=object)

In [44]:
## Make the different dataframe for each Region 
df_apac=df[df.Region=="APAC"]
df_europe=df[df.Region=="Europe"]
df_americas=df[df.Region=="Americas"]

In [49]:
## Create the function which calculate the lower and upper limit
def get_limit(data):
     Q1, Q3 = data.Sales.quantile([0.25,0.75])
    IQR = Q3-Q1
    lower = Q1 - 1.5*IQR
    upper = Q3 + 1.5*IQR
    return lower,upper

In [50]:
#  Cal for the APAC
lower,upper=get_limit(df_apac)
lower,upper

(8038.625, 45121.625)

In [48]:
df_apac.Sales.describe()

count       12.000000
mean     29762.166667
std       7725.522905
min      18579.000000
25%      21944.750000
50%      31215.500000
75%      37066.000000
max      38143.000000
Name: Sales, dtype: float64